import React from 'react';
import '../style/Home.css';

export const Home = () => {
  return (
    <div className="home-container">
      <h1 className="main-title">אתר המתכונים של עמיתי</h1>
      <div className="content-container">
        <div className="description">
          <p>
            ברוכים הבאים לאתר המתכונים <strong>המיוחד</strong> שלי! זהו המקום בו אני מאחסנת את כל <strong>האוצרות הקולינריים</strong> שלי - מתכונים מסורתיים שעברו במשפחה מדור לדור, המצאות מטבח מקוריות שלי, ומתכונים חדשים שגיליתי ואהבתי.
          </p>
          
          <p>
            האתר הזה נולד מתוך <strong>אהבתי העזה לבישול ולאפייה</strong>. כל מתכון כאן מספר סיפור - אם זה המרק המנחם של סבתא, העוגה שאפיתי לראשונה כשהייתי ילדה, או המנה החדשנית שהמצאתי אתמול בלילה. כל אחד מהם הוא חלק ממסע הטעמים האישי שלי.
          </p>
          
          <p>
            מעבר להיותו ארכיון דיגיטלי למתכונים שלי, האתר הזה הוא גם הדרך שלי <strong>לחלוק את אהבתי לאוכל עם העולם</strong>. אני מאמינה שאוכל הוא יותר מסתם מזון - הוא מחבר בין אנשים, יוצר זיכרונות, ומביא שמחה.
          </p>
          
          <p>
            כמובן, אחת המטרות העיקריות של האתר היא לרכז את כל <strong>המתכונים האהובים על בן זוגי</strong> במקום אחד. ככה אני יכולה בקלות למצוא ולהכין את המנות האהובות עליו, ולהפתיע אותו מדי פעם עם משהו חדש ומרגש.
          </p>
          
          <p>
            אני מזמינה אתכם לשוטט באתר, לגלות מתכונים חדשים, ואולי אפילו למצוא <strong>השראה למסע קולינרי משלכם</strong>. אל תהססו לנסות את המתכונים, לשנות אותם לטעמכם, ובעיקר - ליהנות מהתהליך ומהתוצאה!
          </p>
          
          <p>
            מקווה שתמצאו כאן הרבה טעמים, רעיונות והשראה. <strong>בתיאבון!</strong>
          </p>
        </div>
        <div className="image-container">
          <img src="/homepic.jpg" />
        </div>
      </div>
    </div>
  );
};